<details ><summary>plan for accounts_ndgov-prod_us-east-1_s3_second_s3 2025-01-09 16:04:42 (UTC)</summary>
  <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.new_bucket will be created
  + resource "aws_s3_bucket" "new_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "my-uniquesecond-slashnextsnx"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Account"   = "ndgov-prod"
          + "ManagedBy" = "Terragrunt"
          + "Owner"     = "DevOpsTeam"
          + "Project"   = "ndgov-prod/us-east-1/s3/second_s3"
          + "Region"    = "us-east-1"
        }
      + tags_all                    = {
          + "Account"   = "ndgov-prod"
          + "ManagedBy" = "Terragrunt"
          + "Owner"     = "DevOpsTeam"
          + "Project"   = "ndgov-prod/us-east-1/s3/second_s3"
          + "Region"    = "us-east-1"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_arn = (known after apply)
  + bucket_id  = (known after apply)

Warning: Argument is deprecated

  with aws_s3_bucket.new_bucket,
  on main.tf line 1, in resource "aws_s3_bucket" "new_bucket":
   1: resource "aws_s3_bucket" "new_bucket" {

Use the aws_s3_bucket_versioning resource instead

(and one more similar warning elsewhere)

```
</details>
</details>